<a href="https://colab.research.google.com/github/chitinglow/data_wrangling/blob/main/ThinkPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

account_info = pd.DataFrame({"name" : ["Bob", "Mary", "Mita"],
                             "account" : [123845, 123972, 347209],
                             "balance": [123, 3972, 7209]})
account_info["name"]

0     Bob
1    Mary
2    Mita
Name: name, dtype: object

In [2]:
account_info["name"] = ["Smith", "Jane", "Patel"]
account_info

    name  account  balance
0  Smith   123845      123
1   Jane   123972     3972
2  Patel   347209     7209

In [3]:
account_info[['name', 'balance']]

    name  balance
0  Smith      123
1   Jane     3972
2  Patel     7209

In [4]:
# The iloc method (accessing rows)
# First row
account_info.iloc[1]

name         Jane
account    123972
balance      3972
Name: 1, dtype: object

In [5]:
# first two rows
account_info.iloc[0:2]

    name  account  balance
0  Smith   123845      123
1   Jane   123972     3972

In [7]:
# all rows
account_info[:]

    name  account  balance
0  Smith   123845      123
1   Jane   123972     3972
2  Patel   347209     7209

In [8]:
# Select 3rd columns 2nd rows
account_info.iloc[1,2]

3972

In [11]:
# update row record
account_info.iloc[1,2] = 3975
account_info.iloc[1,2]

3975

In [12]:
# accessing first and third columns
account_info.iloc[:, [0,2]]

    name  balance
0  Smith      123
1   Jane     3975
2  Patel     7209

In [14]:
# boolean for iloc
account_info.iloc[account_info.index %2 == 1]

   name  account  balance
1  Jane   123972     3975

In [15]:
# loc method index into a dataframe via names or labels
account_info.loc[1, 'balance']

3975

In [16]:
account_info.loc[:, ['name','balance']]

    name  balance
0  Smith      123
1   Jane     3975
2  Patel     7209

In [19]:
# multi indexing 
import pandas as pd
import numpy as np


customers = pd.MultiIndex.from_tuples(
    (("Bob", "smithb"), ("Mary", "mj100"), ("Mita", "patelm")),
    names=["name", "username"],
)

accounts = pd.MultiIndex.from_tuples(
    ((0, "number"), (0, "balance"), (1, "number"), (1, "balance")), names=["account", "account_info"]
)

account_info = pd.DataFrame(
    [[123846, 123, 123847, 450], [123972, 3972, 123973, 222], [347209, 7209, np.nan, np.nan]],
    index=customers,
    columns=accounts,
)

print(account_info)

print(account_info.loc[("Mary", "mj100"), pd.IndexSlice[:, "balance"]])

account             0                 1
account_info   number balance    number balance
name username
Bob  smithb    123846     123  123847.0   450.0
Mary mj100     123972    3972  123973.0   222.0
Mita patelm    347209    7209       NaN     NaN
account  account_info
0        balance         3972.0
1        balance          222.0
Name: (Mary, mj100), dtype: float64

In [20]:
# combining dataframes using merge

building_records_1844 = pd.DataFrame(
    [["Grande Hotel", 1830],
    ["Jone’s Farm", 1842],
    ["Public Library", 1836],
    ["Marietta House", 1823]],
    columns=["building", "established"],
).set_index(["building"])

building_records_2020 = pd.DataFrame(
    [["Sam’s Bakery", 1962],
    ["Grande Hotel", 1830],
    ["Public Library", 1836],
    ["Mayberry’s Factory", 1924]],
    columns=["building", "established"],
).set_index(["building"])

In [21]:
print(building_records_1844)

print(building_records_2020)

                established
building
Grande Hotel           1830
Jone’s Farm            1842
Public Library         1836
Marietta House         1823
                    established
building
Sam’s Bakery               1962
Grande Hotel               1830
Public Library             1836
Mayberry’s Factory         1924

In [24]:
# merging two data sets without duplication
cols = building_records_2020.columns.difference(building_records_1844.columns)
pd.merge(building_records_1844, building_records_2020[cols], how='inner', on=['building'])

                established
building
Grande Hotel           1830
Public Library         1836

In [26]:
# merging two data sets full show all row no duplication
gene_group1 = pd.DataFrame(
    [["Myc", 2, 0.05],
    ["BRCA1", 3, 0.01],
    ["BRCA2", 8, 0.02]],
    columns=["id", "FC1", "P1"],
).set_index(["id"])

gene_group2 = pd.DataFrame(
    [["Myc", 2, 0.05],
    ["BRCA1", 3, 0.01],
    ["Notch1", 2, 0.03],
    ["BRCA2", 8, 0.02]],
    columns=["id", "FC2", "P2"],
).set_index(["id"])

print(gene_group1)

print(gene_group2)

print(pd.merge(gene_group1, gene_group2, how="outer", on=["id"]))

       FC1    P1
id
Myc      2  0.05
BRCA1    3  0.01
BRCA2    8  0.02
        FC2    P2
id
Myc       2  0.05
BRCA1     3  0.01
Notch1    2  0.03
BRCA2     8  0.02
        FC1    P1  FC2    P2
id
Myc     2.0  0.05    2  0.05
BRCA1   3.0  0.01    3  0.01
BRCA2   8.0  0.02    8  0.02
Notch1  NaN   NaN    2  0.03

In [27]:
# Left join

building_records_1844 = pd.DataFrame(
    [["Grande Hotel", 1832],
    ["Jone’s Farm", 1842],
    ["Public Library", 1836],
    ["Marietta House", 1823]],
    columns=["building", "established"],
)

building_records_2020 = pd.DataFrame(
    [["Sam’s Bakery", 1962],
    ["Grande Hotel", 1830],
    ["Public Library", 1836],
    ["Mayberry’s Factory", 1924]],
    columns=["building", "established"],
)


print(building_records_1844)

print(building_records_2020)

merged_records = pd.merge(
    building_records_2020,
    building_records_1844,
    how="left",
    right_on="building",
    left_on="building",
    suffixes=("_2000", ""),
)

print(merged_records)

merged_records["established"].fillna(merged_records["established_2000"], inplace=True)

del merged_records["established_2000"]

print(merged_records)

         building  established
0    Grande Hotel         1832
1     Jone’s Farm         1842
2  Public Library         1836
3  Marietta House         1823
             building  established
0        Sam’s Bakery         1962
1        Grande Hotel         1830
2      Public Library         1836
3  Mayberry’s Factory         1924
             building  established_2000  established
0        Sam’s Bakery              1962          NaN
1        Grande Hotel              1830       1832.0
2      Public Library              1836       1836.0
3  Mayberry’s Factory              1924          NaN
             building  established
0        Sam’s Bakery       1962.0
1        Grande Hotel       1832.0
2      Public Library       1836.0
3  Mayberry’s Factory       1924.0

In [28]:
# anti join

trial_a_records = pd.DataFrame(
    [[230858, "John"],
    [237340, "May"],
    [240932, "Catherine"],
    [124093, "Ahmed"]],
    columns=["patient", "name"],
).set_index("patient")

trial_b_records = pd.DataFrame(
    [[210858, "Abi"],
    [237340, "May"],
    [240932, "Catherine"],
    [154093, "Julia"]],
    columns=["patient", "name"],
).set_index("patient")

print(trial_a_records)

print(trial_b_records)


both_trials = pd.merge(trial_a_records, trial_b_records, how="outer", right_index=True, left_index=True, indicator=True, on="name")
print(both_trials)


print(both_trials.query('_merge != "both"').drop("_merge", 1))


both_trials = (
    pd.merge(trial_a_records, trial_b_records, how="outer", right_index=True, left_index=True, indicator=True, on="name")
    .query('_merge != "both"')
    .drop("_merge", 1)
)

              name
patient
230858        John
237340         May
240932   Catherine
124093       Ahmed
              name
patient
210858         Abi
237340         May
240932   Catherine
154093       Julia
              name      _merge
patient
124093       Ahmed   left_only
154093       Julia  right_only
210858         Abi  right_only
230858        John   left_only
237340         May        both
240932   Catherine        both
          name
patient
124093   Ahmed
154093   Julia
210858     Abi
230858    John

In [29]:
# combine dataframe with join method
building_records_1844 = pd.DataFrame(
    [["Grande Hotel", 1831],
    ["Jone’s Farm", 1842],
    ["Public Library", 1836],
    ["Marietta House", 1823]],
    columns=["building", "established"],
).set_index("building")

building_records_2020 = pd.DataFrame(
    [["Sam’s Bakery", 1962],
    ["Grande Hotel", 1830],
    ["Public Library", 1835],
    ["Mayberry’s Factory", 1924]],
    columns=["building", "established"],
).set_index("building")

print(building_records_1844)

print(building_records_2020)

print(building_records_1844.join(building_records_2020, how="inner", rsuffix="_2000"))

                established
building
Grande Hotel           1831
Jone’s Farm            1842
Public Library         1836
Marietta House         1823
                    established
building
Sam’s Bakery               1962
Grande Hotel               1830
Public Library             1835
Mayberry’s Factory         1924
                established  established_2000
building
Grande Hotel           1831              1830
Public Library         1836              1835

In [30]:
# concat dataframe
temp_county_a = pd.DataFrame(
    [[(4,5), 35.6],
    [(1,2), 37.4],
    [(6,4), 36.3],
    [(1,7), 40.2]],
    columns=["location", "temp"],
).set_index(["location"])

temp_county_b = pd.DataFrame(
    [[(6,4), 34.2],
    [(0,4), 33.7],
    [(3,8), 38.1],
    [(1,5), 37.0]],
    columns=["location", "temp"],
).set_index(["location"])


print(temp_county_a)

print(temp_county_b)

print(pd.concat([temp_county_a, temp_county_b]))

          temp
location
(4, 5)    35.6
(1, 2)    37.4
(6, 4)    36.3
(1, 7)    40.2
          temp
location
(6, 4)    34.2
(0, 4)    33.7
(3, 8)    38.1
(1, 5)    37.0
          temp
location
(4, 5)    35.6
(1, 2)    37.4
(6, 4)    36.3
(1, 7)    40.2
(6, 4)    34.2
(0, 4)    33.7
(3, 8)    38.1
(1, 5)    37.0

In [31]:

temp_device_a = pd.DataFrame(
    [[(4,5), 35.6],
    [(1,2), 37.4],
    [(6,4), 36.3],
    [(1,7), 40.2]],
    columns=["location", "temp"],
).set_index(["location"])

temp_device_b = pd.DataFrame(
    [[(4,5), 34.2],
    [(1,2), 36.7],
    [(6,4), 37.1],
    [(1,7), 39.0]],
    columns=["location", "temp"],
).set_index(["location"])


print(temp_device_a)

print(temp_device_b)

print(pd.concat([temp_device_a, temp_device_b], keys=["device_a", "device_b"], axis=1))

          temp
location
(4, 5)    35.6
(1, 2)    37.4
(6, 4)    36.3
(1, 7)    40.2
          temp
location
(4, 5)    34.2
(1, 2)    36.7
(6, 4)    37.1
(1, 7)    39.0
         device_a device_b
             temp     temp
location
(4, 5)       35.6     34.2
(1, 2)       37.4     36.7
(6, 4)       36.3     37.1
(1, 7)       40.2     39.0

In [37]:
# Data transformation pivot and pivot table

df = pd.DataFrame(
    [
        ["Diner", (4, 2), "02/18", 90],
        ["Pandas", (5, 4), "04/18", 55],
        ["Diner", (4, 2), "05/18", 100],
        ["Pandas", (5, 4), "01/18", 76],
    ],
    columns=["restaurant", "location", "date", "score"],
)

df

  restaurant location   date  score
0      Diner   (4, 2)  02/18     90
1     Pandas   (5, 4)  04/18     55
2      Diner   (4, 2)  05/18    100
3     Pandas   (5, 4)  01/18     76

In [33]:
df = df.pivot_table(values=['score'], index=['restaurant', 'location'], aggfunc=np.mean)
df

                     score
restaurant location
Diner      (4, 2)     95.0
Pandas     (5, 4)     65.5

In [39]:
df = pd.DataFrame(
    [
        ["Diner", (4, 2), "02/18", 90],
        ["Pandas", (5, 4), "04/18", 55],
        ["Diner", (4, 2), "05/18", 100],
        ["Pandas", (5, 4), "01/18", 76],
    ],
    columns=["restaurant", "location", "date", "score"],
).set_index(["restaurant", "location"])
df = df[['score']].groupby(['restaurant', 'location']).mean()
df

                     score
restaurant location
Diner      (4, 2)     95.0
Pandas     (5, 4)     65.5

In [44]:
df = pd.DataFrame(
    [
        ["02/18", 90, 1384, 10],
        ["02/25", 80, 1384, 10],
        ["03/07", 65, 1384, 10],
        ["03/21", 60, 1384, 10],
        ["02/18", 30, 1389, 7],
        ["02/25", 20, 1389, 7],
        ["03/07", 25, 1389, 7],
        ["03/21", 25, 1389, 7],
    ],
    columns=["date", "tumor_size", "drug", "dose"],
)

df.pivot(index="drug", columns="date", values="tumor_size")

date  02/18  02/25  03/07  03/21
drug
1384     90     80     65     60
1389     30     20     25     25

In [46]:
# Stack | Unstack or reshape dataframe
df = (
    pd.DataFrame(
        [
            ["Diner", (4, 2), 0, 90],
            ["Pandas", (5, 4), 0, 55],
            ["Diner", (4, 2), 1, 100],
            ["Pandas", (5, 4), 1, 76],
        ],
        columns=["restaurant", "location", "inspection", "score"],
    )
    .set_index(["restaurant", "location", "inspection"])
    .unstack()
)
df

                    score
inspection              0    1
restaurant location
Diner      (4, 2)      90  100
Pandas     (5, 4)      55   76

In [47]:
df = df.stack().reset_index()
df

  restaurant location  inspection  score
0      Diner   (4, 2)           0     90
1      Diner   (4, 2)           1    100
2     Pandas   (5, 4)           0     55
3     Pandas   (5, 4)           1     76

In [49]:
df.drop(columns=['inspection'], inplace = True)
df.set_index(['restaurant', 'location'], inplace = True)
df

                     score
restaurant location
Diner      (4, 2)       90
           (4, 2)      100
Pandas     (5, 4)       55
           (5, 4)       76

In [50]:
df = pd.DataFrame(
    [
        ["Diner", (4, 2), 90],
        ["Pandas", (5, 4), 55],
        ["Diner", (4, 2), 100],
        ["Pandas", (5, 4), 76],
    ],
    columns=["restaurant", "location", "score"],
).set_index(["restaurant", "location"])

print(df)
df["inspection"] = df.groupby(["restaurant", "location"]).cumcount()
df.set_index("inspection", append=True, inplace=True)

print(df)
df = df.unstack()
print(df)

                     score
restaurant location
Diner      (4, 2)       90
Pandas     (5, 4)       55
Diner      (4, 2)      100
Pandas     (5, 4)       76
                                score
restaurant location inspection
Diner      (4, 2)   0              90
Pandas     (5, 4)   0              55
Diner      (4, 2)   1             100
Pandas     (5, 4)   1              76
                    score
inspection              0    1
restaurant location
Diner      (4, 2)      90  100
Pandas     (5, 4)      55   76

In [51]:
# Melt dataframe

df = pd.DataFrame(
    [["Diner", (4, 2), 90, 100], ["Pandas", (5, 4), 55, 76]],
    columns=["restaurant", "location", 0, 1],
)

print(df)
df = df.melt(
    id_vars=["restaurant", "location"], value_vars=[0, 1], value_name="score"
).drop(columns="variable")
print(df)

  restaurant location   0    1
0      Diner   (4, 2)  90  100
1     Pandas   (5, 4)  55   76
  restaurant location  score
0      Diner   (4, 2)     90
1     Pandas   (5, 4)     55
2      Diner   (4, 2)    100
3     Pandas   (5, 4)     76

In [52]:
# Transpose dataframe

patient_list = pd.DataFrame(
    [["O+", 2394, "hbp"], ["B+", 2312, np.nan], ["O-", 23409, "lbp"]],
    columns=["blood_type", "id", "history"],
).set_index(["blood_type"])

drug_table = pd.DataFrame(
    [
        ["ADF", "ADF", "ACB", "DCB", "ACE", "BAB"],
        ["GCB", "RAB", "DF", "EFR", np.nan, "HEF"],
        ["RAB", np.nan, np.nan, np.nan, np.nan, np.nan],
    ],
    columns=["O+", "O-", "A+", "A-", "B+", "B-"],
)

print(patient_list)
print(drug_table)
drug_table = drug_table.transpose(copy=False)
print(drug_table)
print(patient_list.join(drug_table))

               id history
blood_type
O+           2394     hbp
B+           2312     NaN
O-          23409     lbp
    O+   O-   A+   A-   B+   B-
0  ADF  ADF  ACB  DCB  ACE  BAB
1  GCB  RAB   DF  EFR  NaN  HEF
2  RAB  NaN  NaN  NaN  NaN  NaN
      0    1    2
O+  ADF  GCB  RAB
O-  ADF  RAB  NaN
A+  ACB   DF  NaN
A-  DCB  EFR  NaN
B+  ACE  NaN  NaN
B-  BAB  HEF  NaN
               id history    0    1    2
blood_type
O+           2394     hbp  ADF  GCB  RAB
B+           2312     NaN  ACE  NaN  NaN
O-          23409     lbp  ADF  RAB  NaN

In [53]:
# The apply method
df = pd.DataFrame({"a": [0, 1, 2, 3], "b": [0, 1, 2, 3]})

df.sum(axis=1)

0    0
1    2
2    4
3    6
dtype: int64

In [55]:
df = pd.DataFrame({"A": [0, np.nan, np.nan, 4], "B": [0, 1, 2, 3], "C": [0, 4, 1, 5]})


def replace_missing(series):
    if np.isnan(series["A"]):
        series["A"] = max(series["B"], series["C"])
    return series


df = df.apply(replace_missing, axis=1)
df

     A    B    C
0  0.0  0.0  0.0
1  4.0  1.0  4.0
2  2.0  2.0  1.0
3  4.0  3.0  5.0

In [57]:
df = pd.DataFrame({"A": [0, np.nan, np.nan, 4], "B": [0, 1, 2, 3], "C": [0, 4, 1, 5]})

df["A"].where(~df["A"].isna(), df[["B", "C"]].max(axis=1), inplace=True)
df

     A  B  C
0  0.0  0  0
1  4.0  1  4
2  2.0  2  1
3  4.0  3  5

In [58]:
def test_fruit_in_order(series):
    if series["fruit"].lower() in series["order"].lower():
        return series
    return np.nan


data = pd.DataFrame(
    {
        "fruit": ["orange", "lemon", "mango"],
        "order": ["I'd like an orange", "Mango please.", "May I have a mango?"],
    }
)

print(data)
print(data.apply(test_fruit_in_order, axis=1, result_type="reduce").dropna())

    fruit                order
0  orange   I'd like an orange
1   lemon        Mango please.
2   mango  May I have a mango?
    fruit                order
0  orange   I'd like an orange
2   mango  May I have a mango?